# StairsPathType Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsPathType Class
Members See Also
---
An object represents the stairs path type.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class StairsPathType : ElementType
```

Visual Basic
---
```text
Public Class StairsPathType _
	Inherits ElementType
```

Visual C++
---
```text
public ref class StairsPathType : public ElementType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB.Architecture..::..StairsPathType
# See Also
StairsPathType Members
Autodesk.Revit.DB.Architecture Namespace